[zh-CN|简体中文]
MAINWND.TITLE = "网络调试工具"
MAINWND.STATIC.DEVICE.TYPE = "类型"
MAINWND.STATIC.MEMORY.MAX = "限制"
MAINWND.STATIC.CHANNEL = "通道"
MAINWND.BUTTON.CONNECT.TITLE = "连接"
MAINWND.BUTTON.DECONNECT.TITLE = "断开"
MAINWND.BUTTON.CLRSTAT.TITLE = "清除统计信息"
MAINWND.CHECK.SHOW.RECVDATA = "不显示数据"
MAINWND.CHECK.AUTO.ADDITIONAL = "添加接收信息"
MAINWND.CHECK.AUTO.SAVE = "自动保存"
MAINWND.BUTTON.RECV.CLEAR = "清除"
MAINWND.BUTTON.RECV.SAVE = "保存"
MAINWND.BUTTON.CLOSE_CHANNEL = "关闭通道"
MAINWND.BUTTON.SEND_FILE = "发送文件"
MAINWND.BUTTON.SEND_HISTORY = "历史记录"
MAINWND.BUTTON.SEND = "发送"
MAINWND.BUTTON.SEND.CLEAR = "清除"

MAINWND.PROP.BOOLLABELTRUE = "是"
MAINWND.PROP.BOOLLABELFALSE = "否"

MAINWND.TXT.SEND.INTERVAL.PLACEHOLDER = "定时发送(ms)"

MAINWND.STATISTICSCTRL.RECV.BYTES = "接收字节  : %s B"
MAINWND.STATISTICSCTRL.SEND.BYTES = "发送字节  : %s B"
MAINWND.STATISTICSCTRL.RECV.SPEED = "接收速度  : %s"
MAINWND.STATISTICSCTRL.SEND.SPEED = "发送速度  : %s"

MENU.POP.SETTING = "设置(&S) ..."
MENU.POP.ABOUTAPP = "关于程序(&A) ..."

TOOLTIP.BTN.CONNECT = "连接或断开通讯"
TOOLTIP.BTN.CLEARSTAT = "清除统计信息（不会清除真实的收发数据）"
TOOLTIP.COMBO.MEMORY.MAX = "设置接收的数据，在前台显示和后台保存的最大内存使用量"
TOOLTIP.CHECK.SHOW.RECVDATA = "打开后将不会显示接收到的数据（不影响接收数据），该选项将极大提升收发性能。"
TOOLTIP.CHECK.AUTO.ADDITIONAL = "每条消息前增加一个标题（包括通道信息和时间）"
TOOLTIP.CHECK.AUTO.SAVE = "当接收的内容超出限制后，自动保存到文件中(仅仅保存接收的原始内容，和显示无关)，再将内容清空"
TOOLTIP.FILE.PATH = "自动保存的文件路径."
TOOLTIP.RECV.DISPLAY.TYPE = "选择接收内容的显示方式."
TOOLTIP.BUTTON.RECV.CLEAR = "清除接收内容。"
TOOLTIP.BUTTON.RECV.SAVE = "保存接收内容到文件中(仅仅保存接收的原始内容，和显示无关)。"
TOOLTIP.CMB.CHANNELS = "已建立的通讯通道列表。"
TOOLTIP.BUTTON.CLOSE.CHANNEL = "关闭当前选择的通讯通道。"
TOOLTIP.BUTTON.SEND.FILE = "选择一个文件进行发送。"
TOOLTIP.BUTTON.SEND.HISTORY = "选择发送的历史记录。"
TOOLTIP.EDIT.SEND.INTERVAL = "设置自动循环发送的时间间隔，如果设置为0，表示关闭循环发送。"
TOOLTIP.BUTTON.SEND = "将发送框中的内容发送到当前选择的通道上。"

POPTIP.TITLE.INFO = "提示"
POPTIP.BODY.HIDE_OUTPUT_WARNING = "请注意：现在接收将不会显示到软件界面上，但后台接收仍在继续,当保存文件时，仍将是完整的接收内容。"


SEND.HISTORY.DIALOG.TITLE = "历史记录"
SEND.HISTORY.DIALOG.OK = "确定"
SEND.HISTORY.DIALOG.CLEAR = "清空记录"
SEND.HISTORY.DIALOG.TYPE = "类型"
SEND.HISTORY.DIALOG.DATA = "数据"

ABOUT.DIALOG.TITLE = "关于本程序"
ABOUT.DIALOG.STATIC.VERSION = "NetDebugger，版本 1.0"
ABOUT.DIALOG.STATIC.COPYRIGHT = " (C) 2020 Kevin 版权所有"

DEVICE.CLASS.SERIALPORT.TITLE = "串口通讯"

DEVICE.SERIALPORT.PROP.PORTNAME = "串口号\r\n串口设备号"
DEVICE.SERIALPORT.PROP.PORTNAME.NOTFOUND = "没有找到任何串口设备"
DEVICE.SERIALPORT.PROP.BAUDRATE = "波特率\r\n设置串口波特率"
DEVICE.SERIALPORT.PROP.CHARSIZE = "数据位\r\n设置串口字节数据位数"
DEVICE.SERIALPORT.PROP.STOPBITS = "停止位\r\n设置串口停止位长度"
DEVICE.SERIALPORT.PROP.STOPBITS.EM0 = "1 位"
DEVICE.SERIALPORT.PROP.STOPBITS.EM1 = "1.5 位"
DEVICE.SERIALPORT.PROP.STOPBITS.EM2 = "2 位"
DEVICE.SERIALPORT.PROP.PARITY = "数据校验\r\n设置串口数据校验方式"
DEVICE.SERIALPORT.PROP.PARITY.EM0 = "无校验"
DEVICE.SERIALPORT.PROP.PARITY.EM1 = "奇校验"
DEVICE.SERIALPORT.PROP.PARITY.EM2 = "偶校验"
DEVICE.SERIALPORT.PROP.FC = "流控方式\r\n设置串口流控方式"
DEVICE.SERIALPORT.PROP.FC.EM0 = "无流控"
DEVICE.SERIALPORT.PROP.FC.EM1 = "软件流控"
DEVICE.SERIALPORT.PROP.FC.EM2 = "硬件流控"
DEVICE.SERIALPORT.PROP.DTR = "DTR状态\r\n设置串口DTR管脚状态"
DEVICE.SERIALPORT.PROP.DTR.EM0 = "关"
DEVICE.SERIALPORT.PROP.DTR.EM1 = "开"

DEVICE.CLASS.SERIALPORTSWITCH.TITLE = "串口转发"
DEVICE.SERIALPORTSWITCH.PROP.PORT1 = "1号串口"
DEVICE.SERIALPORTSWITCH.PROP.PORT2 = "2号串口"

DEVICE.CLASS.TCPCLIENT.TITLE = "TCP 客户端"
DEVICE.TCPCLIENT.PROP.HOST = "主机\r\n服务器名称或地址(IPV4 / IPV6), 部分操作系统不支持IPV6。"
DEVICE.TCPCLIENT.PROP.REMOTEPORT = "主机端口\r\n服务器监听端口"
DEVICE.TCPCLIENT.PROP.KEEPALIVE = "保持活动\r\n设置Socket Keepalive 选项（默认关闭）"
DEVICE.TCPCLIENT.PROP.PROTOCOL = "协议\r\n通讯使用的IP协议（只能查看）"

DEVICE.CLASS.TCPMULTIPLECLIENT.TITLE = "TCP 多并发客户端"
DEVICE.TCPMULTIPLECLIENT.PROP.CANONSCOUNT = "并发数量\r\n同时向服务器发起多个连接，连接数量由该参数指定."
DEVICE.TCPMULTIPLECLIENT.PROP.CONNCOUNT = "连接数\r\n本次已完成的连接数量."

DEVICE.CLASS.TCPSERVER.TITLE = "TCP 服务端"
DEVICE.TCPSERVER.PROP.LISTENADDRESS = "监听地址\r\n监听的网卡地址(IPV4 / IPV6), 部分操作系统不支持IPV6。"
DEVICE.TCPSERVER.PROP.LISTENPORT = "监听端口\r\n监听的端口号[0-65535]"
DEVICE.TCPSERVER.PROP.REUSEADDRESS = "地址复用\r\n设置Socket ReuseAddress 选项（默认关闭）"
DEVICE.TCPSERVER.PROP.KEEPALIVE = "保持活动\r\n设置Socket Keepalive 选项（默认关闭）"
DEVICE.TCPSERVER.PROP.PROTOCOL = "协议\r\n通讯使用的IP协议（只能查看）"

DEVICE.CLASS.TCPFORWARDSERVER.TITLE = "TCP 转发服务端"
DEVICE.TCPFORWARDSERVER.PROP.LOCAL = "本地监听"
DEVICE.TCPFORWARDSERVER.PROP.REMOTE = "转发目标"
DEVICE.TCPFORWARDSERVER.PROP.LISTENADDRESS = "监听地址\r\n监听的网卡地址(IPV4 / IPV6), 部分操作系统不支持IPV6。"
DEVICE.TCPFORWARDSERVER.PROP.LISTENPORT = "监听端口\r\n监听的端口号[0-65535]"
DEVICE.TCPFORWARDSERVER.PROP.REMOTEHOST = "远程主机\r\n转发指向服务器名称或地址(IPV4 / IPV6), 部分操作系统不支持IPV6。"
DEVICE.TCPFORWARDSERVER.PROP.REMOTEPORT = "远端端口\r\n转发服务器监听端口"
DEVICE.TCPFORWARDSERVER.PROP.REUSEADDRESS = "地址复用\r\n设置Socket ReuseAddress 选项（默认关闭）"
DEVICE.TCPFORWARDSERVER.PROP.KEEPALIVE = "保持活动\r\n设置Socket Keepalive 选项（默认关闭）"

DEVICE.CLASS.UDPBASIC.TITLE = "UDP 基础通讯"
DEVICE.UDPBASIC.PROP.BINDADDRESS = "绑定地址\r\nUDP通讯绑定的本地网卡地址(IPV4 / IPV6), 部分操作系统不支持IPV6。"
DEVICE.UDPBASIC.PROP.BINDPORT = "绑定端口\r\n监听的端口号[0-65535]"
DEVICE.UDPBASIC.PROP.REMOTEHOST = "服务器地址\r\nUDP通讯的目的主机名或地址(IPV4 / IPV6), 部分操作系统不支持IPV6。如果为空，则表示不指定特定主机。"
DEVICE.UDPBASIC.PROP.REMOTEPORT = "服务器端口\r\n目的地端口号[0-65535]，如果为0，则表示不指定特定主机。"
DEVICE.UDPBASIC.PROP.REUSEADDRESS = "地址复用\r\n设置Socket ReuseAddress 选项（默认关闭）"
DEVICE.UDPBASIC.PROP.PROTOCOL = "协议\r\n通讯使用的IP协议（只能查看）"

DEVICE.CLASS.UDPCLIENT.TITLE = "UDP 广播通讯"
DEVICE.UDPCLIENT.PROP.REMOTEHOST = "服务器地址\r\nUDP通讯的目的主机名或地址(IPV4 / IPV6), 部分操作系统不支持IPV6。如果为空，则表示不指定特定主机。"
DEVICE.UDPCLIENT.PROP.REMOTEPORT = "服务器端口\r\n目的地端口号[0-65535]，如果为0，则表示不指定特定主机。"
DEVICE.UDPCLIENT.PROP.BROADCAST = "广播模式\r\n设置 UDP 为广播模式"
DEVICE.UDPCLIENT.PROP.REUSEADDRESS = "地址复用\r\n设置Socket ReuseAddress 选项（默认关闭）"
DEVICE.UDPCLIENT.PROP.PROTOCOL = "协议\r\n通讯使用的IP协议（只能查看）"

DEVICE.CLASS.WEBSOCKETSINGLECLIENT.TITLE = "WebSocket 客户端"
DEVICE.WEBSOCKETCLIENT.PROP.REMOTEHOST = "服务器地址\r\n服务器的Websocket连接地址(如: ws://localhost:8080/test)"
DEVICE.WEBSOCKETCLIENT.PROP.DATAMODE = "数据模式\r\n向服务器发送数据时采用的数据模式（BINARY | TEXT）"
DEVICE.WEBSOCKETCLIENT.PROP.MASKED = "掩码处理\r\n向服务器发送数据时Payload是否经过掩码处理"
DEVICE.WEBSOCKETCLIENT.PROP.AH0 = "附加头[0]\r\n连接时附加的HTTP头. (可选)"
DEVICE.WEBSOCKETCLIENT.PROP.AH1 = "附加头[1]\r\n连接时附加的HTTP头. (可选)"
DEVICE.WEBSOCKETCLIENT.PROP.AH2 = "附加头[2]\r\n连接时附加的HTTP头. (可选)"
DEVICE.WEBSOCKETCLIENT.PROP.AH3 = "附加头[3]\r\n连接时附加的HTTP头. (可选)"
DEVICE.WEBSOCKETCLIENT.PROP.AH4 = "附加头[4]\r\n连接时附加的HTTP头. (可选)"
DEVICE.WEBSOCKETCLIENT.PROP.AH5 = "附加头[5]\r\n连接时附加的HTTP头. (可选)"

DEVICE.WEBSOCKET.PROP.DATAMODE.EM0 = "二制进"
DEVICE.WEBSOCKET.PROP.DATAMODE.EM1 = "文本"

DEVICE.CLASS.WEBSOCKETMULTIPLECLIENT.TITLE = "WebSocket 多并发客户端"
DEVICE.WEBSOCKETMULTIPLECLIENT.PROP.CANONSCOUNT = "并发数量\r\n同时向服务器发起多个连接，连接数量由该参数指定."
DEVICE.WEBSOCKETMULTIPLECLIENT.PROP.CONNCOUNT = "连接数\r\n本次已完成的连接数量."

DEVICE.CLASS.WEBSOCKETSERVER.TITLE = "WebSocket 服务器"
DEVICE.WEBSOCKETSERVER.LISTENADDRESS = "监听地址\r\n监听的网卡地址(IPV4 / IPV6), 部分操作系统不支持IPV6。"
DEVICE.WEBSOCKETSERVER.PROP.LISTENPORT = "监听端口\r\n监听的端口号[0-65535]"
DEVICE.WEBSOCKETSERVER.PROP.URL = "路径\r\nURL 路径。例如：/Test \r\n注意：如果设置了该值，客户端必须使用该路径连接。"
DEVICE.WEBSOCKETSERVER.PROP.DATAMODE = "数据模式\r\n向服务器发送数据时采用的数据模式（BINARY | TEXT）"

DEVICE.WEBSOCKETSERVER.PROP.MASKED = "掩码处理\r\n向服务器发送数据时Payload是否经过掩码处理"

[en-US|English (U.S.)]
MAINWND.TITLE = "Network debugger"
MAINWND.STATIC.DEVICE.TYPE = "Type"
MAINWND.STATIC.MEMORY.MAX = "Limit"
MAINWND.STATIC.CHANNEL = "Channels"
MAINWND.BUTTON.CONNECT.TITLE = "Connect"
MAINWND.BUTTON.DECONNECT.TITLE = "Deconnect"
MAINWND.BUTTON.CLRSTAT.TITLE = "Clear statistics"
MAINWND.CHECK.SHOW.RECVDATA = "Not display"
MAINWND.CHECK.AUTO.ADDITIONAL = "Add recv sign"
MAINWND.CHECK.AUTO.SAVE = "Auto Save"
MAINWND.BUTTON.RECV.CLEAR = "Clear"
MAINWND.BUTTON.RECV.SAVE = "Save"
MAINWND.BUTTON.CLOSE_CHANNEL = "Close"
MAINWND.BUTTON.SEND_FILE = "Send file"
MAINWND.BUTTON.SEND_HISTORY = "Historys"
MAINWND.BUTTON.SEND = "Send"
MAINWND.BUTTON.SEND.CLEAR = "Clear"

MAINWND.PROP.BOOLLABELTRUE = "True"
MAINWND.PROP.BOOLLABELFALSE = "False"

MAINWND.TXT.SEND.INTERVAL.PLACEHOLDER = "Interval(ms)"

MAINWND.STATISTICSCTRL.RECV.BYTES = "RX Bytes : %s B"
MAINWND.STATISTICSCTRL.SEND.BYTES = "TX Bytes : %s B"
MAINWND.STATISTICSCTRL.RECV.SPEED = "RX Speed : %s"
MAINWND.STATISTICSCTRL.SEND.SPEED = "TX Speed : %s"

MENU.POP.SETTING = "Setting(&S) ..."
MENU.POP.ABOUTAPP = "About(&A) ..."

TOOLTIP.BTN.CONNECT = "Connect or disconnect"
TOOLTIP.BTN.CLEARSTAT = "Clear statistics (but, does not clear real send and receive data)"
TOOLTIP.COMBO.MEMORY.MAX = "Sets the maximum memory usage that is received, displayed in the fore desk, and saved in the background."
TOOLTIP.CHECK.SHOW.RECVDATA = "When turned on, the received data will not be displayed (without affecting the received data), and this option will greatly improve sending and receiving performance."
TOOLTIP.CHECK.AUTO.ADDITIONAL = "Add a title (including channel information and time) before each message"
TOOLTIP.CHECK.AUTO.SAVE = "When the received content exceeds the limit, it is automatically saved to the file (only the original content received is saved, independent of the display), and then the content is emptied."
TOOLTIP.FILE.PATH = "Automatically saved file path."
TOOLTIP.RECV.DISPLAY.TYPE = "Choose how the content is displayed."
TOOLTIP.BUTTON.RECV.CLEAR = "Clear the received content."
TOOLTIP.BUTTON.RECV.SAVE = "Save the received content to the file (only the original content received is saved, independent of the display)."
TOOLTIP.CMB.CHANNELS = "A list of established communication channels."
TOOLTIP.BUTTON.CLOSE.CHANNEL = "Close the currently selected communication channel."
TOOLTIP.BUTTON.SEND.FILE = "Select a file to send."
TOOLTIP.BUTTON.SEND.HISTORY = "Select the history of the send."
TOOLTIP.EDIT.SEND.INTERVAL = "Set the interval for automatic looping, and if set to 0, it means turning off loop sending."
TOOLTIP.BUTTON.SEND = "Send the contents of the send box to the channel you are currently selecting."

POPTIP.TITLE.INFO = "Tips"
POPTIP.BODY.HIDE_OUTPUT_WARNING = "Note: Receive now will not appear on the software interface, but background reception continues and will remain complete when the file is saved."

SEND.HISTORY.DIALOG.TITLE = "History"
SEND.HISTORY.DIALOG.OK = "OK"
SEND.HISTORY.DIALOG.CLEAR = "Clear Historys"
SEND.HISTORY.DIALOG.TYPE = "Type"
SEND.HISTORY.DIALOG.DATA = "Data"

ABOUT.DIALOG.TITLE = "About"
ABOUT.DIALOG.STATIC.VERSION = "NetDebugger，version 1.0"
ABOUT.DIALOG.STATIC.COPYRIGHT = "(C) 2020 Kevin Copyright."

DEVICE.CLASS.SERIALPORT.TITLE = "SerialPort"

DEVICE.SERIALPORT.PROP.PORTNAME = "Device\r\nSerial device number."
DEVICE.SERIALPORT.PROP.PORTNAME.NOTFOUND = "Device not found"
DEVICE.SERIALPORT.PROP.BAUDRATE = "Baud rate\r\nSet the serial port baud rate"
DEVICE.SERIALPORT.PROP.CHARSIZE = "Data size\r\nSet the serial port character size"
DEVICE.SERIALPORT.PROP.STOPBITS = "Stop bits\r\nSet the serial port stop bits count"
DEVICE.SERIALPORT.PROP.STOPBITS.EM0 = "1 Bit"
DEVICE.SERIALPORT.PROP.STOPBITS.EM1 = "1.5 Bit"
DEVICE.SERIALPORT.PROP.STOPBITS.EM2 = "2 Bit"
DEVICE.SERIALPORT.PROP.PARITY = "Parity\r\nSet the serial port parity mode"
DEVICE.SERIALPORT.PROP.PARITY.EM0 = "None"
DEVICE.SERIALPORT.PROP.PARITY.EM1 = "Odd"
DEVICE.SERIALPORT.PROP.PARITY.EM2 = "Even"
DEVICE.SERIALPORT.PROP.FC = "Handshake\r\nSet the serial port handshake"
DEVICE.SERIALPORT.PROP.FC.EM0 = "None"
DEVICE.SERIALPORT.PROP.FC.EM1 = "Software"
DEVICE.SERIALPORT.PROP.FC.EM2 = "Hardware"
DEVICE.SERIALPORT.PROP.DTR = "DTR\r\nSet the serial port DTR pin state"
DEVICE.SERIALPORT.PROP.DTR.EM0 = "Off"
DEVICE.SERIALPORT.PROP.DTR.EM1 = "On"

DEVICE.CLASS.SERIALPORTSWITCH.TITLE = "SerialPort Forward"
DEVICE.SERIALPORTSWITCH.PROP.PORT1 = "#1"
DEVICE.SERIALPORTSWITCH.PROP.PORT2 = "#2"

DEVICE.CLASS.TCPCLIENT.TITLE = "TCP Client"
DEVICE.TCPCLIENT.PROP.HOST = "Host\r\nServer name or address (IPV4 / IPV6), IPV6 is not supported by some operating systems."
DEVICE.TCPCLIENT.PROP.REMOTEPORT = "Port\r\nThe Server listening port."
DEVICE.TCPCLIENT.PROP.KEEPALIVE = "Keepalive\r\nSet socket Keepalive option"
DEVICE.TCPCLIENT.PROP.PROTOCOL = "Protocol\r\nIP protocol for communication (view only)"

DEVICE.CLASS.TCPMULTIPLECLIENT.TITLE = "TCP Multiple Client"
DEVICE.TCPMULTIPLECLIENT.PROP.CANONSCOUNT = "Canons\r\nMultiple connections are initiated to the server at the same time, and the number of connections is specified by this parameter."
DEVICE.TCPMULTIPLECLIENT.PROP.CONNCOUNT = "Connections\r\nThe number of connections completed."

DEVICE.CLASS.TCPSERVER.TITLE = "TCP Server"
DEVICE.TCPSERVER.PROP.LISTENADDRESS = "ListenAddress\r\nListen address (IPV4 / IPV6), IPV6 is not supported by some operating systems."
DEVICE.TCPSERVER.PROP.LISTENPORT = "ListenPort\r\nListen TCP port[0-65535]"
DEVICE.TCPSERVER.PROP.REUSEADDRESS = "ReuseAddress\r\nSet socket Reuseaddress option"
DEVICE.TCPSERVER.PROP.KEEPALIVE = "KeepAlive\r\nSet socket Keepalive option"
DEVICE.TCPSERVER.PROP.PROTOCOL = "Protocol\r\nIP protocol for communication (view only)"

DEVICE.CLASS.TCPFORWARDSERVER.TITLE = "TCP Forward Server"
DEVICE.TCPFORWARDSERVER.PROP.LOCAL = "Listen"
DEVICE.TCPFORWARDSERVER.PROP.REMOTE = "Destination"
DEVICE.TCPFORWARDSERVER.PROP.LISTENADDRESS = "Address\r\nListen address (IPV4 / IPV6), IPV6 is not supported by some operating systems."
DEVICE.TCPFORWARDSERVER.PROP.LISTENPORT = "Port\r\nListen TCP port[0-65535]"
DEVICE.TCPFORWARDSERVER.PROP.REMOTEHOST = "Address\r\nForward the destination server name or address (IPV4 / IPV6), which is not supported by some operating systems."
DEVICE.TCPFORWARDSERVER.PROP.REMOTEPORT = "Port\r\nForward the destination port."
DEVICE.TCPFORWARDSERVER.PROP.REUSEADDRESS = "Reuseaddress\r\nSet socket Reuseaddress option"
DEVICE.TCPFORWARDSERVER.PROP.KEEPALIVE = "KeepAlive\r\nSet socket Keepalive option"

DEVICE.CLASS.UDPBASIC.TITLE = "UDP Basic"
DEVICE.UDPBASIC.PROP.BINDADDRESS = "BindAddress\r\nUDP communication, Bind to the local network card address (IPV4 / IPV6), some operating systems do not support IPV6."
DEVICE.UDPBASIC.PROP.BINDPORT = "BindPort\r\nPort number of listening [0-65535]"
DEVICE.UDPBASIC.PROP.REMOTEHOST = "RemoteHost\r\nThe remote host name or address (IPV4 / IPV6) of UDP communication, IPV6 is not supported by some operating systems. If empty, no specific host is specified."
DEVICE.UDPBASIC.PROP.REMOTEPORT = "RemotePort\r\nDestination Port No. (0-65535)."
DEVICE.UDPBASIC.PROP.REUSEADDRESS = "ReuseAddress\r\nSet the Socket ReuseAddress option (off by default)"
DEVICE.UDPBASIC.PROP.PROTOCOL = "Protocol\r\nIP protocol for communication (view only)"

DEVICE.CLASS.UDPCLIENT.TITLE = "UDP Broadcast"
DEVICE.UDPCLIENT.PROP.REMOTEHOST = "RemoteHost\r\nUDP communication, Bind to the local network card address (IPV4 / IPV6), some operating systems do not support IPV6."
DEVICE.UDPCLIENT.PROP.REMOTEPORT = "RemotePort\r\nDestination Port No. (0-65535)."
DEVICE.UDPCLIENT.PROP.BROADCAST = "Broadcast\r\nSet UDP to broadcast mode."
DEVICE.UDPCLIENT.PROP.REUSEADDRESS = "ReuseAddress\r\nSet the Socket ReuseAddress option (off by default)"
DEVICE.UDPCLIENT.PROP.PROTOCOL = "Protocol\r\nIP protocol for communication (view only)"

DEVICE.CLASS.WEBSOCKETSINGLECLIENT.TITLE = "WebSocket Client"
DEVICE.WEBSOCKETCLIENT.PROP.REMOTEHOST = "Address\r\nWebsocket address of the server (e.g. ws://localhost:8080/test)"
DEVICE.WEBSOCKETCLIENT.PROP.DATAMODE = "DataMode\r\nThe data pattern used to send data to the server.（BINARY | TEXT）"
DEVICE.WEBSOCKETCLIENT.PROP.MASKED = "Masked\r\nIndicates whether Payload was masked when data was sent to the server."
DEVICE.WEBSOCKETCLIENT.PROP.AH0 = "Header[0]\r\nThe http head attached to the connection. (Optional)"
DEVICE.WEBSOCKETCLIENT.PROP.AH1 = "Header[1]\r\nThe http head attached to the connection. (Optional)"
DEVICE.WEBSOCKETCLIENT.PROP.AH2 = "Header[2]\r\nThe http head attached to the connection. (Optional)"
DEVICE.WEBSOCKETCLIENT.PROP.AH3 = "Header[3]\r\nThe http head attached to the connection. (Optional)"
DEVICE.WEBSOCKETCLIENT.PROP.AH4 = "Header[4]\r\nThe http head attached to the connection. (Optional)"
DEVICE.WEBSOCKETCLIENT.PROP.AH5 = "Header[5]\r\nThe http head attached to the connection. (Optional)"

DEVICE.WEBSOCKET.PROP.DATAMODE.EM0 = "Binary"
DEVICE.WEBSOCKET.PROP.DATAMODE.EM1 = "Text"

DEVICE.CLASS.WEBSOCKETMULTIPLECLIENT.TITLE = "WebSocket Multiple Client"
DEVICE.WEBSOCKETMULTIPLECLIENT.PROP.CANONSCOUNT = "Canons\r\nMultiple connections are initiated to the server at the same time, and the number of connections is specified by this parameter."
DEVICE.WEBSOCKETMULTIPLECLIENT.PROP.CONNCOUNT = "Connections\r\nThe number of connections completed."

DEVICE.CLASS.WEBSOCKETSERVER.TITLE = "WebSocket Server"
DEVICE.WEBSOCKETSERVER.LISTENADDRESS = "ListenAddress\r\nListen address (IPV4 / IPV6), IPV6 is not supported by some operating systems."
DEVICE.WEBSOCKETSERVER.PROP.LISTENPORT = "ListenPort\r\nListen TCP port[0-65535]"
DEVICE.WEBSOCKETSERVER.PROP.URL = "URL Path\r\nURL address. For example: /Test \r\n Note: If this value is set, the client must use that URL path to connect."
DEVICE.WEBSOCKETSERVER.PROP.DATAMODE = "DataMode\r\nThe data pattern used to send data to the server.（BINARY | TEXT）"
DEVICE.WEBSOCKETSERVER.PROP.MASKED = "Masked\r\nIndicates whether Payload was masked when data was sent to the server."

[ja-JP|日本語]
MAINWND.TITLE = "ネットワーク デバッグ ツール"
MAINWND.STATIC.DEVICE.TYPE = "类型"
MAINWND.STATIC.MEMORY.MAX = "限制"
MAINWND.STATIC.CHANNEL = "通道"
MAINWND.BUTTON.CONNECT.TITLE = "接続します"
MAINWND.BUTTON.DECONNECT.TITLE = "切断します"
MAINWND.BUTTON.CLRSTAT.TITLE = "清除统计信息"
MAINWND.CHECK.SHOW.RECVDATA = "不显示数据"
MAINWND.CHECK.AUTO.ADDITIONAL = "添加接收信息"
MAINWND.CHECK.AUTO.SAVE = "自动保存"
MAINWND.BUTTON.RECV.CLEAR = "清除"
MAINWND.BUTTON.RECV.SAVE = "保存"
MAINWND.BUTTON.CLOSE_CHANNEL = "关闭通道"
MAINWND.BUTTON.SEND_FILE = "发送文件"
MAINWND.BUTTON.SEND_HISTORY = "历史记录"
MAINWND.BUTTON.SEND = "发送"
MAINWND.BUTTON.SEND.CLEAR = "清除"

MAINWND.PROP.BOOLLABELTRUE = "はい"
MAINWND.PROP.BOOLLABELFALSE = "いいえ"

MAINWND.TXT.SEND.INTERVAL.PLACEHOLDER = "送信間隔(ms)"

MAINWND.STATISTICSCTRL.RECV.BYTES = "受信数量 : %s B"
MAINWND.STATISTICSCTRL.SEND.BYTES = "送信数量 : %s B"
MAINWND.STATISTICSCTRL.RECV.SPEED = "受信速度 : %s"
MAINWND.STATISTICSCTRL.SEND.SPEED = "送信速度 : %s"

MENU.POP.SETTING = "設定(&S) ..."
MENU.POP.ABOUTAPP = "プログラム情報(&A) ..."

TOOLTIP.BTN.CONNECT = "通信を接続または切断します。"
TOOLTIP.BTN.CLEARSTAT = "統計のクリア (ただし、実際のトランシーバ データは消去されません)"
TOOLTIP.COMBO.MEMORY.MAX = "设置接收的数据，在前台显示和后台保存的最大内存使用量"
TOOLTIP.CHECK.SHOW.RECVDATA = "打开后将不会显示接收到的数据（不影响接收数据），该选项将极大提升收发性能。"
TOOLTIP.CHECK.AUTO.ADDITIONAL = "每条消息前增加一个标题（包括通道信息和时间）"
TOOLTIP.CHECK.AUTO.SAVE = "当接收的内容超出限制后，自动保存到文件中(仅仅保存接收的原始内容，和显示无关)，再将内容清空"
TOOLTIP.FILE.PATH = "自动保存的文件路径."
TOOLTIP.RECV.DISPLAY.TYPE = "选择接收内容的显示方式."
TOOLTIP.BUTTON.RECV.CLEAR = "清除接收内容。"
TOOLTIP.BUTTON.RECV.SAVE = "保存接收内容到文件中(仅仅保存接收的原始内容，和显示无关)。"
TOOLTIP.CMB.CHANNELS = "已建立的通讯通道列表。"
TOOLTIP.BUTTON.CLOSE.CHANNEL = "关闭当前选择的通讯通道。"
TOOLTIP.BUTTON.SEND.FILE = "选择一个文件进行发送。"
TOOLTIP.BUTTON.SEND.HISTORY = "选择发送的历史记录。"
TOOLTIP.EDIT.SEND.INTERVAL = "设置自动循环发送的时间间隔，如果设置为0，表示关闭循环发送。"
TOOLTIP.BUTTON.SEND = "将发送框中的内容发送到当前选择的通道上。"

POPTIP.TITLE.INFO = "ヒント情報"
POPTIP.BODY.HIDE_OUTPUT_WARNING = "注: 受信はソフトウェア インターフェイスに表示されませんが、バックグラウンド受信は続行され、ファイルを保存すると完全な受信コンテンツが残ります。"

SEND.HISTORY.DIALOG.TITLE = "历史记录"
SEND.HISTORY.DIALOG.OK = "确定"
SEND.HISTORY.DIALOG.CLEAR = "清空记录"
SEND.HISTORY.DIALOG.TYPE = "类型"
SEND.HISTORY.DIALOG.DATA = "数据"

ABOUT.DIALOG.TITLE = "关于本程序"
ABOUT.DIALOG.STATIC.VERSION = "NetDebugger，版本 1.0"
ABOUT.DIALOG.STATIC.COPYRIGHT = " (C) 2020 Kevin 版权所有"

DEVICE.CLASS.SERIALPORT.TITLE = "シリアル通信"
DEVICE.SERIALPORT.PROP.PORTNAME = "デバイス番号\r\nシリアル デバイス番号。"
DEVICE.SERIALPORT.PROP.PORTNAME.NOTFOUND = "シリアルデバイスが見つからないです"
DEVICE.SERIALPORT.PROP.BAUDRATE = "ボーレート\r\nシリアル ポートのボー レートを設定します"
DEVICE.SERIALPORT.PROP.CHARSIZE = "データ ビット\r\nシリアル バイト データ ビットの数を設定します"
DEVICE.SERIALPORT.PROP.STOPBITS = "ストップビット\r\nシリアルストップビット数を設定します"
DEVICE.SERIALPORT.PROP.STOPBITS.EM0 = "1 Bit"
DEVICE.SERIALPORT.PROP.STOPBITS.EM1 = "1.5 Bit"
DEVICE.SERIALPORT.PROP.STOPBITS.EM2 = "2 Bit"
DEVICE.SERIALPORT.PROP.PARITY = "チェック\r\nシリアル チェック方法を設定します"
DEVICE.SERIALPORT.PROP.PARITY.EM0 = "なし"
DEVICE.SERIALPORT.PROP.PARITY.EM1 = "奇数"
DEVICE.SERIALPORT.PROP.PARITY.EM2 = "偶数"
DEVICE.SERIALPORT.PROP.FC = "コントロール\r\nハンドシェイク制御方法を設定します"
DEVICE.SERIALPORT.PROP.FC.EM0 = "なし"
DEVICE.SERIALPORT.PROP.FC.EM1 = "ソフトウェア"
DEVICE.SERIALPORT.PROP.FC.EM2 = "ハードウェア"
DEVICE.SERIALPORT.PROP.DTR = "DTR\r\nシリアル DTR ピンの状態を設定します"
DEVICE.SERIALPORT.PROP.DTR.EM0 = "オフ"
DEVICE.SERIALPORT.PROP.DTR.EM1 = "オン"

DEVICE.CLASS.SERIALPORTSWITCH.TITLE = "シリアル転送"
DEVICE.SERIALPORTSWITCH.PROP.PORT1 = "1号串口"
DEVICE.SERIALPORTSWITCH.PROP.PORT2 = "2号串口"


DEVICE.CLASS.TCPCLIENT.TITLE = "TCP 客户端"
DEVICE.TCPCLIENT.PROP.HOST = "主机\r\n服务器名称或地址(IPV4 / IPV6), 部分操作系统不支持IPV6。"
DEVICE.TCPCLIENT.PROP.REMOTEPORT = "主机端口\r\n服务器监听端口"
DEVICE.TCPCLIENT.PROP.KEEPALIVE = "保持活动\r\n设置Socket Keepalive 选项（默认关闭）"
DEVICE.TCPCLIENT.PROP.PROTOCOL = "协议\r\n通讯使用的IP协议（只能查看）"

DEVICE.CLASS.TCPMULTIPLECLIENT.TITLE = "TCP 多并发客户端"
DEVICE.TCPMULTIPLECLIENT.PROP.CANONSCOUNT = "并发数量\r\n同时向服务器发起多个连接，连接数量由该参数指定."
DEVICE.TCPMULTIPLECLIENT.PROP.CONNCOUNT = "连接数\r\n本次已完成的连接数量."

DEVICE.CLASS.TCPSERVER.TITLE = "TCP 服务端"
DEVICE.TCPSERVER.PROP.LISTENADDRESS = "监听地址\r\n监听的网卡地址(IPV4 / IPV6), 部分操作系统不支持IPV6。"
DEVICE.TCPSERVER.PROP.LISTENPORT = "监听端口\r\n监听的端口号[0-65535]"
DEVICE.TCPSERVER.PROP.REUSEADDRESS = "地址复用\r\n设置Socket ReuseAddress 选项（默认关闭）"
DEVICE.TCPSERVER.PROP.KEEPALIVE = "保持活动\r\n设置Socket Keepalive 选项（默认关闭）"
DEVICE.TCPSERVER.PROP.PROTOCOL = "协议\r\n通讯使用的IP协议（只能查看）"

DEVICE.CLASS.TCPFORWARDSERVER.TITLE = "TCP 转发服务端"
DEVICE.TCPFORWARDSERVER.PROP.LOCAL = "本地监听"
DEVICE.TCPFORWARDSERVER.PROP.REMOTE = "转发目标"
DEVICE.TCPFORWARDSERVER.PROP.LISTENADDRESS = "监听地址\r\n监听的网卡地址(IPV4 / IPV6), 部分操作系统不支持IPV6。"
DEVICE.TCPFORWARDSERVER.PROP.LISTENPORT = "监听端口\r\n监听的端口号[0-65535]"
DEVICE.TCPFORWARDSERVER.PROP.REMOTEHOST = "远程主机\r\n转发指向服务器名称或地址(IPV4 / IPV6), 部分操作系统不支持IPV6。"
DEVICE.TCPFORWARDSERVER.PROP.REMOTEPORT = "远端端口\r\n转发服务器监听端口"
DEVICE.TCPFORWARDSERVER.PROP.REUSEADDRESS = "地址复用\r\n设置Socket ReuseAddress 选项（默认关闭）"
DEVICE.TCPFORWARDSERVER.PROP.KEEPALIVE = "保持活动\r\n设置Socket Keepalive 选项（默认关闭）"

DEVICE.CLASS.UDPBASIC.TITLE = "UDP 基础通讯"
DEVICE.UDPBASIC.PROP.BINDADDRESS = "绑定地址\r\nUDP通讯绑定的本地网卡地址(IPV4 / IPV6), 部分操作系统不支持IPV6。"
DEVICE.UDPBASIC.PROP.BINDPORT = "绑定端口\r\n监听的端口号[0-65535]"
DEVICE.UDPBASIC.PROP.REMOTEHOST = "服务器地址\r\nUDP通讯的目的主机名或地址(IPV4 / IPV6), 部分操作系统不支持IPV6。如果为空，则表示不指定特定主机。"
DEVICE.UDPBASIC.PROP.REMOTEPORT = "服务器端口\r\n目的地端口号[0-65535]，如果为0，则表示不指定特定主机。"
DEVICE.UDPBASIC.PROP.REUSEADDRESS = "地址复用\r\n设置Socket ReuseAddress 选项（默认关闭）"
DEVICE.UDPBASIC.PROP.PROTOCOL = "协议\r\n通讯使用的IP协议（只能查看）"

DEVICE.CLASS.UDPCLIENT.TITLE = "UDP 广播通讯"
DEVICE.UDPCLIENT.PROP.REMOTEHOST = "服务器地址\r\nUDP通讯的目的主机名或地址(IPV4 / IPV6), 部分操作系统不支持IPV6。如果为空，则表示不指定特定主机。"
DEVICE.UDPCLIENT.PROP.REMOTEPORT = "服务器端口\r\n目的地端口号[0-65535]，如果为0，则表示不指定特定主机。"
DEVICE.UDPCLIENT.PROP.BROADCAST = "广播模式\r\n设置 UDP 为广播模式"
DEVICE.UDPCLIENT.PROP.REUSEADDRESS = "地址复用\r\n设置Socket ReuseAddress 选项（默认关闭）"
DEVICE.UDPCLIENT.PROP.PROTOCOL = "协议\r\n通讯使用的IP协议（只能查看）"

DEVICE.CLASS.WEBSOCKETSINGLECLIENT.TITLE = "WebSocket 客户端"
DEVICE.WEBSOCKETCLIENT.PROP.REMOTEHOST = "服务器地址\r\n服务器的Websocket连接地址(如: ws://localhost:8080/test)"
DEVICE.WEBSOCKETCLIENT.PROP.DATAMODE = "数据模式\r\n向服务器发送数据时采用的数据模式（BINARY | TEXT）"
DEVICE.WEBSOCKETCLIENT.PROP.MASKED = "掩码处理\r\n向服务器发送数据时Payload是否经过掩码处理"
DEVICE.WEBSOCKETCLIENT.PROP.AH0 = "附加头[0]\r\n连接时附加的HTTP头. (可选)"
DEVICE.WEBSOCKETCLIENT.PROP.AH1 = "附加头[1]\r\n连接时附加的HTTP头. (可选)"
DEVICE.WEBSOCKETCLIENT.PROP.AH2 = "附加头[2]\r\n连接时附加的HTTP头. (可选)"
DEVICE.WEBSOCKETCLIENT.PROP.AH3 = "附加头[3]\r\n连接时附加的HTTP头. (可选)"
DEVICE.WEBSOCKETCLIENT.PROP.AH4 = "附加头[4]\r\n连接时附加的HTTP头. (可选)"
DEVICE.WEBSOCKETCLIENT.PROP.AH5 = "附加头[5]\r\n连接时附加的HTTP头. (可选)"

DEVICE.WEBSOCKET.PROP.DATAMODE.EM0 = "二制进"
DEVICE.WEBSOCKET.PROP.DATAMODE.EM1 = "文本"

DEVICE.CLASS.WEBSOCKETMULTIPLECLIENT.TITLE = "WebSocket 多并发客户端"
DEVICE.WEBSOCKETMULTIPLECLIENT.PROP.CANONSCOUNT = "并发数量\r\n同时向服务器发起多个连接，连接数量由该参数指定."
DEVICE.WEBSOCKETMULTIPLECLIENT.PROP.CONNCOUNT = "连接数\r\n本次已完成的连接数量."

DEVICE.CLASS.WEBSOCKETSERVER.TITLE = "WebSocket 服务器"
DEVICE.WEBSOCKETSERVER.LISTENADDRESS = "监听地址\r\n监听的网卡地址(IPV4 / IPV6), 部分操作系统不支持IPV6。"
DEVICE.WEBSOCKETSERVER.PROP.LISTENPORT = "监听端口\r\n监听的端口号[0-65535]"
DEVICE.WEBSOCKETSERVER.PROP.URL = "路径\r\nURL 路径。例如：/Test \r\n注意：如果设置了该值，客户端必须使用该路径连接。"
DEVICE.WEBSOCKETSERVER.PROP.DATAMODE = "数据模式\r\n向服务器发送数据时采用的数据模式（BINARY | TEXT）"

DEVICE.WEBSOCKETSERVER.PROP.MASKED = "掩码处理\r\n向服务器发送数据时Payload是否经过掩码处理"